lains/stm32-linky-display/src/main.cpp
/* Includes ------------------------------------------------------------------*/
#include "Stm32SerialDriver.h"
#include "Stm32LcdDriver.h"
#include "Stm32TimerDriver.h"
#include "Stm32DebugOutput.h"
#include "Stm32MonotonicTimeDriver.h"
#include "TIC/Unframer.h"
#include "TicProcessingContext.h"
#include "PowerHistory.h"
#include "TicFrameParser.h"
#include "HistoryDraw.h"

//#define SIMULATE_POWER_VALUES_WITHOUT_TIC

extern "C" {
#include "main.h"
#include <stdio.h>
#include "font58.h"

static void SystemClock_Config(void); /* Defined below */
}

#ifdef USE_STM32F769I_DISCO
static void MPU_Config(void);
static void CPU_CACHE_Enable(void);
#endif

/* Private define ------------------------------------------------------------*/
const unsigned int LCDWidth = 800;
const unsigned int LCDHeight = 480;
const unsigned int BytesPerPixel = 4; /* For ARGB8888 mode */

#define VSYNC               1 
#define VBP                 1 
#define VFP                 1
#define VACT                LCDHeight
#define HSYNC               1
#define HBP                 1
#define HFP                 1
#define HACT                LCDWidth

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

//static uint32_t ImageIndex = 0;
/*static const uint32_t * Images[] = 
{
    image_320x240_argb8888,
    life_augmented_argb8888,
};*/

/**
  * @brief  On Error Handler on condition TRUE.
  * @param  condition : Can be TRUE or FALSE
  * @retval None
  */
void OnError_Handler(uint32_t condition)
{
    if(condition) {
#ifdef LED_ERROR
        BSP_LED_On(LED_ERROR);
#endif
        while(1) { ; } /* Blocking on error */
    }
}

void Error_Handler() {
	  OnError_Handler(1);
}

/**
 * @brief  Main program
 */
int main(void) {
    /* STM32Fxxx HAL library initialization */
#ifdef USE_STM32F769I_DISCO
    /* Configure the MPU attributes */
    MPU_Config();

    /* Enable the CPU Cache */
    CPU_CACHE_Enable();
#endif

    HAL_Init();
  
    /* Configure the system clock to 180 MHz */
    SystemClock_Config();

    /* Configure the 4 available LEDs on USE_STM32469I_DISCOVERY */
#ifdef USE_STM32469I_DISCOVERY
    BSP_LED_Init(LED_GREEN);
    BSP_LED_Init(LED_RED);
    BSP_LED_Init(LED_ORANGE);
    BSP_LED_Init(LED_BLUE);
#endif
    /* Configure the 2 available LEDs on STM32F769I DISCOVERY */
#ifdef USE_STM32F769I_DISCO
    BSP_LED_Init(LED_RED);
    BSP_LED_Init(LED_GREEN);
#endif
    BSP_LED_On(LED_STARTUP_BLINK);
    waitDelay(250);
    BSP_LED_Off(LED_STARTUP_BLINK);

#ifdef USE_STM32F769I_DISCO
    /* Configure the Tamper push-button in GPIO Mode */
    BSP_PB_Init(BUTTON_WAKEUP, BUTTON_MODE_GPIO);
#endif

    /* Initialize the SDRAM */
    BSP_SDRAM_Init();
    //BSP_SD_Init();

    Stm32DebugOutput::get().start();
    Stm32DebugOutput::get().send("Init\n");

    Stm32SerialDriver& ticSerial = Stm32SerialDriver::get();

    //ticSerial.start(9600); /* For standard TIC */
    ticSerial.start(1200); /* For historical TIC */

    Stm32LcdDriver& lcd = Stm32LcdDriver::get();

    //BSP_TS_Init(800,480);
    /* Initialize the LCD */
    OnError_Handler(!lcd.start());

    PowerHistory powerHistory(PowerHistory::Per5Seconds);

    TicFrameParser ticParser(PowerHistory::unWrapOnNewPowerData, (void *)(&powerHistory));

    auto onFrameCompleteBlinkGreenLedAndInvokeHandler = [](void* context) {
#ifdef LED_TIC_FRAME_RX
        Stm32DebugOutput::get().send("Frame complete\n");
        BSP_LED_Toggle(LED_TIC_FRAME_RX); // Toggle the green LED when a frame has been completely received
#endif
        TicFrameParser::unwrapInvokeOnFrameComplete(context);   /* Invoke the frameparser's onFrameComplete handler */
    };

    TIC::Unframer ticUnframer(TicFrameParser::unwrapInvokeOnFrameNewBytes,
                              onFrameCompleteBlinkGreenLedAndInvokeHandler,
                              (void *)(&ticParser));

    TicProcessingContext ticContext(ticSerial, ticUnframer);

    auto performAtMidnight = [](void* context) {
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        ticContext->currentTime.startNewDayAtMidnight();
    };
    ticParser.onDayOverInvoke(performAtMidnight, static_cast<void*>(&ticContext));

    powerHistory.setContext(&ticContext);

    Stm32DebugOutput::get().send("Waiting for TIC data...\n");

    auto onSecondElapsed = [](void* context) {
        if (context == nullptr)
            return;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        ticContext->currentTime.time.addSeconds(1);
    };
    Stm32MonotonicTimeDriver::get().setOnPeriodElapsed(onSecondElapsed, static_cast<void*>(&ticContext));
    Stm32MonotonicTimeDriver::get().start();

#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
    auto streamTicRxBytesToUnframer = [](void* context) { }; /* Discard any TIC data */
#else
    auto streamTicRxBytesToUnframer = [](void* context) {
        if (context == nullptr)
            return;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        uint8_t streamedBytesBuffer[256];  /* We allow copies of max 256 bytes at a time */
        size_t incomingBytesCount = ticContext->ticSerial.read(streamedBytesBuffer, sizeof(streamedBytesBuffer));
        if (incomingBytesCount == 0)
            return;
        // char countAsStr[4];
        // unsigned int pos = 0;
        // if (incomingBytesCount >= 1000) {
        //     countAsStr[0]='+';
        //     countAsStr[1]='+';
        //     countAsStr[2]='+';
        //     countAsStr[3]='\0';
        // }
        // else {
        //     if (incomingBytesCount >= 100) {
        //         countAsStr[pos++] = '0' + (incomingBytesCount / 100)%10;
        //     }
        //     if (incomingBytesCount >= 10) {
        //         countAsStr[pos++] = '0' + (incomingBytesCount / 10)%10;
        //     }
        //     countAsStr[pos++] = '0' + (incomingBytesCount / 1)%10;
        //     countAsStr[pos++] = '\0';
        // }
        // Stm32DebugOutput::get().send("TIC RX ");
        // Stm32DebugOutput::get().send(countAsStr);
        // Stm32DebugOutput::get().send(" bytes: ");
        // Stm32DebugOutput::get().hexdumpBuffer(streamedBytesBuffer, incomingBytesCount);
        // Stm32DebugOutput::get().send("\n");
        std::size_t processedBytesCount = ticContext->ticUnframer.pushBytes(streamedBytesBuffer, incomingBytesCount);
        if (processedBytesCount < incomingBytesCount) {
            size_t lostBytesCount = incomingBytesCount - processedBytesCount;
            if (lostBytesCount > static_cast<unsigned int>(-1)) {
                lostBytesCount = static_cast<unsigned int>(-1); /* Does not fit in an unsigned int! */
            }
            if (static_cast<unsigned int>(-1) - lostBytesCount < ticContext->lostTicBytes) {
                /* Adding lostBytesCount will imply an overflow an overflow of our counter */
                ticContext->lostTicBytes = static_cast<unsigned int>(-1); /* Maxmimize our counter, we can't do better than this */
            }
            else {
                ticContext->lostTicBytes += lostBytesCount;
            }
        }
        unsigned int serialRxOverflowCount = ticContext->ticSerial.getRxOverflowCount(true);
        if (static_cast<unsigned int>(-1) - serialRxOverflowCount < ticContext->serialRxOverflowCount) {
            /* Adding serialRxOverflowBytes will imply an overflow of our counter */
            ticContext->serialRxOverflowCount = static_cast<unsigned int>(-1); /* Maxmimize our counter, we can't do better than this */
        }
        else {
            ticContext->serialRxOverflowCount += serialRxOverflowCount;
        }
    };
#endif
    auto isNoNewPowerReceivedSinceLastDisplay = [](void* context) -> bool {
        if (context == nullptr)
            return true;
        TicProcessingContext* ticContext = static_cast<TicProcessingContext*>(context);
        return (ticContext->lastParsedFrameNb == ticContext->lastDisplayedPowerFrameNb);
    };

