lains/stm32-linky-display/src/main.cpp
    unsigned int lcdRefreshCount = 0;
#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
    TimeOfDay fakeHorodate(23, 30, 0); // 23h30m00s
#endif

    TicEvaluatedPower lastReceivedPower;

    uint32_t debugContext = 0;
    while (1) {
        lcd.waitForFinalDisplayed(streamTicRxBytesToUnframer, static_cast<void*>(&ticContext)); /* Wait until the LCD displays the final framebuffer */
        //debugTerm.send("Display refresh\r\n");

        Stm32MeasurementTimer fullDisplayCycleTimeMs(true);

#ifdef SIMULATE_POWER_VALUES_WITHOUT_TIC
        {
            int fakePowerRefV = static_cast<int>(3000) - (static_cast<int>((lcdRefreshCount*30) % 6000)); /* Results in sweeping from +3000 to -3000W */
            int fakeMinPower = fakePowerRefV;
            int fakeMaxPower = fakePowerRefV;
            if (fakePowerRefV < 0) { /* When reaching negative values, forge a range instead of an exact measurement to be more realistic */
                fakeMinPower = fakePowerRefV/3;
                fakeMaxPower = fakePowerRefV/4; /* If negative, corrects to -3000 to [-1000;-750] */
            }
            TicEvaluatedPower fakePower(fakeMinPower, fakeMaxPower);
            char sampleHorodateAsCString[] = "e230502233000";
            TIC::Horodate fakeTICFrameHorodate = TIC::Horodate::fromLabelBytes(reinterpret_cast<uint8_t*>(sampleHorodateAsCString), strlen(sampleHorodateAsCString));
            fakeTICFrameHorodate.hour = fakeHorodate.hour;
            fakeTICFrameHorodate.minute = fakeHorodate.minute;
            fakeTICFrameHorodate.second = fakeHorodate.second;
            fakeHorodate.addSeconds(30); /* Fast forward in time */
            ticParser.lastFrameMeasurements.instPower = fakePower;
            powerHistory.onNewPowerData(fakePower, fakeHorodate, ticContext.lastParsedFrameNb);
        }
        ticParser.nbFramesParsed++; /* Introspection for debug */
        ticContext.lastParsedFrameNb = ticParser.nbFramesParsed;
#endif
        /* We can now work on draft buffer */
        uint8_t pos = 0;
        char statusLine[]="@@@@@L @@@@@F @@@@@@@@B @@X H@@:@@:@@ T@@:@@:@@";
        statusLine[pos++]=(lcdRefreshCount / 10000) % 10 + '0';
        statusLine[pos++]=(lcdRefreshCount / 1000) % 10 + '0';
        statusLine[pos++]=(lcdRefreshCount / 100) % 10 + '0';
        statusLine[pos++]=(lcdRefreshCount / 10) % 10 + '0';
        statusLine[pos++]=(lcdRefreshCount / 1) % 10 + '0';
        pos++; // 'L'

        pos++;

        unsigned int framesCount = ticParser.nbFramesParsed;
        statusLine[pos++]=(framesCount / 10000) % 10 + '0';
        statusLine[pos++]=(framesCount / 1000) % 10 + '0';
        statusLine[pos++]=(framesCount / 100) % 10 + '0';
        statusLine[pos++]=(framesCount / 10) % 10 + '0';
        statusLine[pos++]=(framesCount / 1) % 10 + '0';
        pos++; // 'F'

        pos++;

        unsigned long rxBytesCount = ticSerial.getRxBytesTotal();
        statusLine[pos++]=(rxBytesCount / 10000000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1000000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 100000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 10000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 100) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 10) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1) % 10 + '0';
        pos++; // 'B'

        pos++;

        unsigned int serialRxOverflowCount = ticContext.serialRxOverflowCount;
        statusLine[pos++]=(serialRxOverflowCount / 10) % 10 + '0';
        statusLine[pos++]=(serialRxOverflowCount / 1) % 10 + '0';
        pos++; // 'X'

        pos++;

        pos++; // 'H' like time from Horodate
        unsigned int nbSamples = 1;
        PowerHistoryEntry lastMeasurement;
        powerHistory.getLastPower(nbSamples, &lastMeasurement);
        if (nbSamples == 1 && lastMeasurement.timestamp.isValid) {   /* We have a valid last measurement */
            const TimeOfDay& displayedHorodate = lastMeasurement.timestamp;
            unsigned int horodateHour = displayedHorodate.hour;
            statusLine[pos++]=(horodateHour / 10) % 10 + '0';
            statusLine[pos++]=(horodateHour / 1) % 10 + '0';
            pos++;
            unsigned int horodateMinute = displayedHorodate.minute;
            statusLine[pos++]=(horodateMinute / 10) % 10 + '0';
            statusLine[pos++]=(horodateMinute / 1) % 10 + '0';
            pos++;
            unsigned int horodateSecond = displayedHorodate.second;
            statusLine[pos++]=(horodateSecond / 10) % 10 + '0';
            statusLine[pos++]=(horodateSecond / 1) % 10 + '0';
        }
        else {
            pos += 8;
        }

        statusLine[pos] = '\0'; /* Temporarily terminate string, wiping the Txx:xx:xx text */
        BSP_LCD_SetFont(&Font24);
        lcd.fillRect(0, 0, lcd.getWidth(), 3*24, Stm32LcdDriver::LCD_Color::Black);
        auto get_font24_ptr = [](const char c) {
            unsigned int bytesPerGlyph = Font24.Height * ((Font24.Width + 7) / 8);
            return &(Font24.table[(c-' ') * bytesPerGlyph]);
        };
        
        lcd.drawText(0, 2*24, statusLine, Font24.Width, Font24.Height, get_font24_ptr, Stm32LcdDriver::LCD_Color::White, Stm32LcdDriver::LCD_Color::Black);

        statusLine[pos++] = ' ';
        {
            Stm32LcdDriver::LCD_Color textColor = Stm32LcdDriver::LCD_Color::Green;
            if (ticContext.currentTime.relativeToBoot) {
                textColor = Stm32LcdDriver::LCD_Color::Red;
            }
            char* statusLineSystemTime = &(statusLine[pos]);
            pos++; // 'T' like system time (or uptime)
            unsigned int systemTimeHour = ticContext.currentTime.time.hour;
            statusLine[pos++]=(systemTimeHour / 10) % 10 + '0';
            statusLine[pos++]=(systemTimeHour / 1) % 10 + '0';
            pos++;
            unsigned int systemTimeMinute = ticContext.currentTime.time.minute;
            statusLine[pos++]=(systemTimeMinute / 10) % 10 + '0';
            statusLine[pos++]=(systemTimeMinute / 1) % 10 + '0';
            pos++;
            unsigned int systemTimeSecond = ticContext.currentTime.time.second;
            statusLine[pos++]=(systemTimeSecond / 10) % 10 + '0';
            statusLine[pos++]=(systemTimeSecond / 1) % 10 + '0';
            pos++;
            
            /* Draw only the system time part of statusLine (the trailing characters) */
            lcd.drawText((statusLineSystemTime - statusLine)*17, 2*24, statusLineSystemTime, Font24.Width, Font24.Height, get_font24_ptr, textColor, Stm32LcdDriver::LCD_Color::Black);
        }


